In [3]:
#importing pandas Library
import pandas as pd

In [4]:
# reading Astrosat observation.txt file
data_frame=pd.read_csv("AS_observations_cat_Sept2018 (1).txt",sep='\t',names=['Sr.No','Date_Time','U1','U2','CR1','CR2','U3','I1'])

In [5]:
data_frame.head()

,Sr.No,Date_Time,U1,U2,CR1,CR2,U3,I1
0,1,2018-09-08 00:58:44,G08_066,T02,38.657792,-8.788100,G08_066T02_9000002346:: NGC 985,uvit2
1,2,2018-09-08 10:05:00,A04_104,T03,311.040700,-10.723457,A04_104T03_9000002348:: Mrk 509,sxt
2,3,2018-09-09 06:55:34,G08_081,T01,308.063667,37.637472,G08_081T01_9000002350:: EXO 2030+375,sxt
3,4,2018-09-10 04:06:12,T02_087,T01,274.005787,-14.036283,T02_087T01_9000002352:: GX 17+2,laxpc2
4,5,2018-09-11 10:40:04,T02_100,T01,248.506708,-47.393000,T02_100T01_9000002354:: 4u1630-472,laxpc1

In [6]:
#Creating new columns to segregrate name of the object
data_frame[['In','Name']]=data_frame['U3'].str.split("::",expand=True)

In [8]:
# Shape of our DataFrame
data_frame.shape

(900, 10)

In [7]:
data_frame.head()

,Sr.No,Date_Time,U1,U2,CR1,CR2,U3,I1,In,Name
0,1,2018-09-08 00:58:44,G08_066,T02,38.657792,-8.788100,G08_066T02_9000002346:: NGC 985,uvit2,G08_066T02_9000002346,NGC 985
1,2,2018-09-08 10:05:00,A04_104,T03,311.040700,-10.723457,A04_104T03_9000002348:: Mrk 509,sxt,A04_104T03_9000002348,Mrk 509
2,3,2018-09-09 06:55:34,G08_081,T01,308.063667,37.637472,G08_081T01_9000002350:: EXO 2030+375,sxt,G08_081T01_9000002350,EXO 2030+375
3,4,2018-09-10 04:06:12,T02_087,T01,274.005787,-14.036283,T02_087T01_9000002352:: GX 17+2,laxpc2,T02_087T01_9000002352,GX 17+2
4,5,2018-09-11 10:40:04,T02_100,T01,248.506708,-47.393000,T02_100T01_9000002354:: 4u1630-472,laxpc1,T02_100T01_9000002354,4u1630-472

In [11]:
# Saving the dataframe as .csv file
data_frame.to_csv('Astro_Sat_obs_final.csv')